In [8]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame({'key': ['b', 'b', 'a'],'data1': range(3)})

In [17]:
df1

  key  data1
0   b      0
1   b      1
2   a      2

In [22]:
df2 = pd.DataFrame({'key': ['b', 'b', 'c'],'data2': range(3)})

In [23]:
df2

  key  data2
0   b      0
1   b      1
2   c      2

In [24]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      0
1   b      0      1
2   b      1      0
3   b      1      1

In [26]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      0
1   b      0      1
2   b      1      0
3   b      1      1

In [29]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    0.0
1   b    0.0    1.0
2   b    1.0    0.0
3   b    1.0    1.0
4   a    2.0    NaN
5   c    NaN    2.0

In [30]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      0
1   b      0      1
2   b      1      0
3   b      1      1

In [31]:
pd.merge(df1, df2, on='key', how='left')

  key  data1  data2
0   b      0    0.0
1   b      0    1.0
2   b      1    0.0
3   b      1    1.0
4   a      2    NaN

In [32]:
pd.merge(df1, df2, on='key', how='right')

  key  data1  data2
0   b    0.0      0
1   b    1.0      0
2   b    0.0      1
3   b    1.0      1
4   c    NaN      2

In [33]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [34]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [35]:
right1

   group_val
a        3.5
b        7.0

In [36]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [37]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [38]:
arr = np.arange(12).reshape((3, 4))

In [39]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [40]:
import numpy as np
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [41]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [42]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [43]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [44]:
s4 = pd.concat([s1, s3])
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  1

In [45]:
s1

a    0
b    1
dtype: int64

In [46]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [47]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [48]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [49]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [50]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [51]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                    name='number'))

In [52]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [53]:
result = data.stack()

In [54]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [55]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [56]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [57]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [59]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [60]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [61]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [62]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [63]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [64]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [65]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [66]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [67]:
melted = pd.melt(df, ['key'])

In [68]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [69]:
reshaped = melted.pivot('key', 'variable', 'value')

In [70]:
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [71]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [72]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [73]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [74]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6

In [75]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [76]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [77]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [78]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [79]:
data['v1'] = range(7)

In [80]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [81]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [87]:
data = pd.DataFrame({'food': ['BACON', 'PULLED PORK', 'bacon',
                              'Pastrami', 'corned CHICKEN', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [88]:
data

             food  ounces
0           BACON     4.0
1     PULLED PORK     3.0
2           bacon    12.0
3        Pastrami     6.0
4  corned CHICKEN     7.5
5           Bacon     8.0
6        pastrami     3.0
7       honey ham     5.0
8        nova lox     6.0

In [84]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [89]:
lowercased = data['food'].str.lower()

In [90]:
lowercased

0             bacon
1       pulled pork
2             bacon
3          pastrami
4    corned chicken
5             bacon
6          pastrami
7         honey ham
8          nova lox
Name: food, dtype: object

In [91]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [92]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [93]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [94]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [95]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [96]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [98]:
data.rename(index={'Ohio': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [99]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [100]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [101]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [102]:
data = np.random.rand(20)

In [103]:
data

array([0.25204985, 0.14611547, 0.77902537, 0.90608284, 0.00954004,
       0.40714433, 0.68976966, 0.38903657, 0.47089144, 0.21449819,
       0.49934233, 0.13966628, 0.09131519, 0.85556249, 0.09596167,
       0.02664282, 0.70321046, 0.4052529 , 0.26866372, 0.32838833])

In [104]:
pd.cut(data, 4, precision=2)

[(0.23, 0.46], (0.0086, 0.23], (0.68, 0.91], (0.68, 0.91], (0.0086, 0.23], ..., (0.0086, 0.23], (0.68, 0.91], (0.23, 0.46], (0.23, 0.46], (0.23, 0.46]]
Length: 20
Categories (4, interval[float64]): [(0.0086, 0.23] < (0.23, 0.46] < (0.46, 0.68] < (0.68, 0.91]]

In [105]:
pd.cut(data, 4)

[(0.234, 0.458], (0.00864, 0.234], (0.682, 0.906], (0.682, 0.906], (0.00864, 0.234], ..., (0.00864, 0.234], (0.682, 0.906], (0.234, 0.458], (0.234, 0.458], (0.234, 0.458]]
Length: 20
Categories (4, interval[float64]): [(0.00864, 0.234] < (0.234, 0.458] < (0.458, 0.682] < (0.682, 0.906]]

In [110]:
cats = pd.qcut(data, 4)

In [111]:
pd.value_counts(cats)

(0.008539999999999999, 0.145]    5
(0.145, 0.359]                   5
(0.359, 0.547]                   5
(0.547, 0.906]                   5
dtype: int64

In [112]:
cats.categories

IntervalIndex([(0.008539999999999999, 0.145], (0.145, 0.359], (0.359, 0.547], (0.547, 0.906]],
              closed='right',
              dtype='interval[float64]')

In [113]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [114]:
data

            0         1         2         3
0    1.642818  0.386510  0.017686  0.098408
1   -0.101355  0.812247 -0.209067 -0.321744
2    0.423665  0.679611  0.097584  1.516249
3    1.397713  1.790132  0.554347  1.047522
4   -0.073027 -0.742032 -1.132383 -0.565987
..        ...       ...       ...       ...
995 -0.509228  1.369471  0.751505  0.865114
996  0.755876  1.225931  0.334478  0.973877
997  0.205109 -0.682510 -1.560965  0.544358
998 -2.212298 -0.635838  0.150379  1.185609
999 -1.657771  1.523939  0.198064 -0.559940

[1000 rows x 4 columns]

In [115]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.058875    -0.009784    -0.033728     0.037367
std       0.989642     0.998802     0.997916     1.004610
min      -3.167224    -3.436641    -3.426812    -3.863854
25%      -0.699712    -0.669492    -0.725172    -0.632643
50%      -0.043406    -0.034207    -0.022070     0.036937
75%       0.594543     0.605293     0.615851     0.682217
max       3.479526     3.336088     3.153506     3.109318

In [116]:
col = data[2]

In [117]:
col

0      0.017686
1     -0.209067
2      0.097584
3      0.554347
4     -1.132383
         ...
995    0.751505
996    0.334478
997   -1.560965
998    0.150379
999    0.198064
Name: 2, Length: 1000, dtype: float64

In [118]:
col[np.abs(col) > 3]

443   -3.426812
497    3.153506
Name: 2, dtype: float64

In [125]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
32   0.757769 -1.505184 -1.307492 -3.058738
443  1.505542  0.311331 -3.426812  0.720743
497  1.765494 -0.014750  3.153506 -0.109780
529  3.479526 -0.789229  1.279067  0.870243
734  1.494854 -1.637766  0.134671  3.074426
736  0.133010  3.336088  1.698930 -0.768184
753 -3.167224 -1.521890  1.578292 -0.932960
758  0.294668 -0.252110  1.151510 -3.863854
839 -0.041057 -0.265877 -1.531419  3.109318
847  0.424441 -3.436641  0.759005  0.247142
855 -0.717104  3.063834  0.355523  0.202009
934 -2.161038 -0.563813  0.137068 -3.119822

In [126]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)

In [127]:
sampler

array([2, 1, 4, 0, 3])

In [128]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [129]:
sampler

array([2, 1, 4, 0, 3])

In [130]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [131]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [132]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [133]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [134]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)

In [135]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [136]:
val = 'Hello,Python, Data Science'
val.split(',')

['Hello', 'Python', ' Data Science']

In [137]:
val.count(',')

2

In [138]:
val.replace(',', '::')

'Hello::Python:: Data Science'

In [139]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [140]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [152]:
m = regex.search(text)

In [153]:
m

In [154]:
print(regex.match(text))

None

In [155]:
text1 = "Dave dave@google.com, Steve steve@gmail.com, Rob rob@gmail.com, Ryan ryan@yahoo.com"

In [159]:
m = regex.search()

In [160]:
m

In [161]:
print(regex.match("Dave dave@google.com"))

None

In [162]:
print(regex.match(text1))

None

In [163]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [164]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [165]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [166]:
print(regex.match(text))

None

In [168]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
seriesdata = pd.Series(data)
seriesdata

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [169]:
seriesdata.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [171]:
seriesdata.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [183]:
import json
db = json.load(open('C:\\Users\\ybathla\\Desktop\\nut.json'))

In [184]:
db

[{'id': 1008,
  'description': 'Cheese, caraway',
  'tags': [],
  'manufacturer': '',
  'group': 'Dairy and Egg Products',
  'portions': [{'amount': 1, 'unit': 'oz', 'grams': 28.35}],
  'nutrients': [{'value': 25.18,
    'units': 'g',
    'description': 'Protein',
    'group': 'Composition'},
   {'value': 29.2,
    'units': 'g',
    'description': 'Total lipid (fat)',
    'group': 'Composition'},
   {'value': 3.06,
    'units': 'g',
    'description': 'Carbohydrate, by difference',
    'group': 'Composition'},
   {'value': 3.28, 'units': 'g', 'description': 'Ash', 'group': 'Other'},
   {'value': 376.0,
    'units': 'kcal',
    'description': 'Energy',
    'group': 'Energy'},
   {'value': 39.28,
    'units': 'g',
    'description': 'Water',
    'group': 'Composition'},
   {'value': 1573.0,
    'units': 'kJ',
    'description': 'Energy',
    'group': 'Energy'},
   {'value': 0.0,
    'units': 'g',
    'description': 'Fiber, total dietary',
    'group': 'Composition'},
   {'value': 673.0,
    'units': 'mg',
    'description': 'Calcium, Ca',
    'group': 'Elements'},
   {'value': 0.64,
    'units': 'mg',
    'description': 'Iron, Fe',
    'group': 'Elements'},
   {'value': 22.0,
    'units': 'mg',
    'description': 'Magnesium, Mg',
    'group': 'Elements'},
   {'value': 490.0,
    'units': 'mg',
    'description': 'Phosphorus, P',
    'group': 'Elements'},
   {'value': 93.0,
    'units': 'mg',
    'description': 'Potassium, K',
    'group': 'Elements'},
   {'value': 690.0,
    'units': 'mg',
    'description': 'Sodium, Na',
    'group': 'Elements'},
   {'value': 2.94,
    'units': 'mg',
    'description': 'Zinc, Zn',
    'group': 'Elements'},
   {'value': 0.024,
    'units': 'mg',
    'description': 'Copper, Cu',
    'group': 'Elements'},
   {'value': 0.021,
    'units': 'mg',
    'description': 'Manganese, Mn',
    'group': 'Elements'},
   {'value': 14.5,
    'units': 'mcg',
    'description': 'Selenium, Se',
    'group': 'Elements'},
   {'value': 1054.0,
    'units': 'IU',
    'description': 'Vitamin A, IU',
    'group': 'Vitamins'},
   {'value': 262.0,
    'units': 'mcg',
    'description': 'Retinol',
    'group': 'Vitamins'},
   {'value': 271.0,
    'units': 'mcg_RAE',
    'description': 'Vitamin A, RAE',
    'group': 'Vitamins'},
   {'value': 0.0,
    'units': 'mg',
    'description': 'Vitamin C, total ascorbic acid',
    'group': 'Vitamins'},
   {'value': 0.031,
    'units': 'mg',
    'description': 'Thiamin',
    'group': 'Vitamins'},
   {'value': 0.45,
    'units': 'mg',
    'description': 'Riboflavin',
    'group': 'Vitamins'},
   {'value': 0.18,
    'units': 'mg',
    'description': 'Niacin',
    'group': 'Vitamins'},
   {'value': 0.19,
    'units': 'mg',
    'description': 'Pantothenic acid',
    'group': 'Vitamins'},
   {'value': 0.074,
    'units': 'mg',
    'description': 'Vitamin B-6',
    'group': 'Vitamins'},
   {'value': 18.0,
    'units': 'mcg',
    'description': 'Folate, total',
    'group': 'Vitamins'},
   {'value': 0.27,
    'units': 'mcg',
    'description': 'Vitamin B-12',
    'group': 'Vitamins'},
   {'value': 0.0,
    'units': 'mcg',
    'description': 'Folic acid',
    'group': 'Vitamins'},
   {'value': 18.0,
    'units': 'mcg',
    'description': 'Folate, food',
    'group': 'Vitamins'},
   {'value': 18.0,
    'units': 'mcg_DFE',
    'description': 'Folate, DFE',
    'group': 'Vitamins'},
   {'value': 93.0,
    'units': 'mg',
    'description': 'Cholesterol',
    'group': 'Other'},
   {'value': 18.584,
    'units': 'g',
    'description': 'Fatty acids, total saturated',
    'group': 'Other'},
   {'value': 8.275,
    'units': 'g',
    'description': 'Fatty acids, total monounsaturated',
    'group': 'Other'},
   {'value': 0.83,
    'units': 'g',
    'description': 'Fatty acids, total polyunsaturated',
    'group': 'Other'},
   {'value': 0.324,
    'units': 'g',
    'description': 'Tryptophan',
    'group': 'Amino Acids'},
   {'value': 0.896,
    'units': 'g',
    'description': 'Threonine',
    'group': 'Amino Acids'},
   {'value': 1.563,
    'units': 'g',
    'description': 'Isoleucine',
    'group': 'Amino Acids'},
   {'value': 2.412,
    'units': 'g',
    'description': 'Leucine',
    'group': 'Amino Acids'},
   {'value': 0.028,
    'units': 'g',
    'description': 'Fatty acids, total monounsaturated',
    'group': 'Other'},
   {'value': 0.041,
    'units': 'g',
    'description': 'Fatty acids, total polyunsaturated',
    'group': 'Other'}]}]

In [185]:
len(db)

1

In [186]:
db[0].keys()

dict_keys(['id', 'description', 'tags', 'manufacturer', 'group', 'portions', 'nutrients'])

In [187]:
db[0]['nutrients'][0]

{'value': 25.18,
 'units': 'g',
 'description': 'Protein',
 'group': 'Composition'}

In [189]:
nutrients = pd.DataFrame(db[0]['nutrients'])

In [190]:
nutrients

       value    units                         description        group
0     25.180        g                             Protein  Composition
1     29.200        g                   Total lipid (fat)  Composition
2      3.060        g         Carbohydrate, by difference  Composition
3      3.280        g                                 Ash        Other
4    376.000     kcal                              Energy       Energy
5     39.280        g                               Water  Composition
6   1573.000       kJ                              Energy       Energy
7      0.000        g                Fiber, total dietary  Composition
8    673.000       mg                         Calcium, Ca     Elements
9      0.640       mg                            Iron, Fe     Elements
10    22.000       mg                       Magnesium, Mg     Elements
11   490.000       mg                       Phosphorus, P     Elements
12    93.000       mg                        Potassium, K     Elements
13   690.000       mg                          Sodium, Na     Elements
14     2.940       mg                            Zinc, Zn     Elements
15     0.024       mg                          Copper, Cu     Elements
16     0.021       mg                       Manganese, Mn     Elements
17    14.500      mcg                        Selenium, Se     Elements
18  1054.000       IU                       Vitamin A, IU     Vitamins
19   262.000      mcg                             Retinol     Vitamins
20   271.000  mcg_RAE                      Vitamin A, RAE     Vitamins
21     0.000       mg      Vitamin C, total ascorbic acid     Vitamins
22     0.031       mg                             Thiamin     Vitamins
23     0.450       mg                          Riboflavin     Vitamins
24     0.180       mg                              Niacin     Vitamins
25     0.190       mg                    Pantothenic acid     Vitamins
26     0.074       mg                         Vitamin B-6     Vitamins
27    18.000      mcg                       Folate, total     Vitamins
28     0.270      mcg                        Vitamin B-12     Vitamins
29     0.000      mcg                          Folic acid     Vitamins
30    18.000      mcg                        Folate, food     Vitamins
31    18.000  mcg_DFE                         Folate, DFE     Vitamins
32    93.000       mg                         Cholesterol        Other
33    18.584        g        Fatty acids, total saturated        Other
34     8.275        g  Fatty acids, total monounsaturated        Other
35     0.830        g  Fatty acids, total polyunsaturated        Other
36     0.324        g                          Tryptophan  Amino Acids
37     0.896        g                           Threonine  Amino Acids
38     1.563        g                          Isoleucine  Amino Acids
39     2.412        g                             Leucine  Amino Acids
40     0.028        g  Fatty acids, total monounsaturated        Other
41     0.041        g  Fatty acids, total polyunsaturated        Other

In [191]:
nutrients[:7]

     value units                  description        group
0    25.18     g                      Protein  Composition
1    29.20     g            Total lipid (fat)  Composition
2     3.06     g  Carbohydrate, by difference  Composition
3     3.28     g                          Ash        Other
4   376.00  kcal                       Energy       Energy
5    39.28     g                        Water  Composition
6  1573.00    kJ                       Energy       Energy

In [193]:
nutrients = nutrients.drop_duplicates()

In [194]:
nutrients

       value    units                         description        group
0     25.180        g                             Protein  Composition
1     29.200        g                   Total lipid (fat)  Composition
2      3.060        g         Carbohydrate, by difference  Composition
3      3.280        g                                 Ash        Other
4    376.000     kcal                              Energy       Energy
5     39.280        g                               Water  Composition
6   1573.000       kJ                              Energy       Energy
7      0.000        g                Fiber, total dietary  Composition
8    673.000       mg                         Calcium, Ca     Elements
9      0.640       mg                            Iron, Fe     Elements
10    22.000       mg                       Magnesium, Mg     Elements
11   490.000       mg                       Phosphorus, P     Elements
12    93.000       mg                        Potassium, K     Elements
13   690.000       mg                          Sodium, Na     Elements
14     2.940       mg                            Zinc, Zn     Elements
15     0.024       mg                          Copper, Cu     Elements
16     0.021       mg                       Manganese, Mn     Elements
17    14.500      mcg                        Selenium, Se     Elements
18  1054.000       IU                       Vitamin A, IU     Vitamins
19   262.000      mcg                             Retinol     Vitamins
20   271.000  mcg_RAE                      Vitamin A, RAE     Vitamins
21     0.000       mg      Vitamin C, total ascorbic acid     Vitamins
22     0.031       mg                             Thiamin     Vitamins
23     0.450       mg                          Riboflavin     Vitamins
24     0.180       mg                              Niacin     Vitamins
25     0.190       mg                    Pantothenic acid     Vitamins
26     0.074       mg                         Vitamin B-6     Vitamins
27    18.000      mcg                       Folate, total     Vitamins
28     0.270      mcg                        Vitamin B-12     Vitamins
29     0.000      mcg                          Folic acid     Vitamins
30    18.000      mcg                        Folate, food     Vitamins
31    18.000  mcg_DFE                         Folate, DFE     Vitamins
32    93.000       mg                         Cholesterol        Other
33    18.584        g        Fatty acids, total saturated        Other
34     8.275        g  Fatty acids, total monounsaturated        Other
35     0.830        g  Fatty acids, total polyunsaturated        Other
36     0.324        g                          Tryptophan  Amino Acids
37     0.896        g                           Threonine  Amino Acids
38     1.563        g                          Isoleucine  Amino Acids
39     2.412        g                             Leucine  Amino Acids
40     0.028        g  Fatty acids, total monounsaturated        Other
41     0.041        g  Fatty acids, total polyunsaturated        Other

In [197]:
info_keys = ['description', 'group', 'id', 'manufacturer']

In [205]:
info = pd.DataFrame(db, columns=info_keys)

In [206]:
info

       description                   group    id manufacturer
0  Cheese, caraway  Dairy and Egg Products  1008

In [209]:
col_mapping = {'description' : 'nutrient','group' : 'nutgroup'}

In [210]:
nutrients = nutrients.rename(columns=col_mapping, copy=False)

In [211]:
nutrients

       value    units                            nutrient     nutgroup
0     25.180        g                             Protein  Composition
1     29.200        g                   Total lipid (fat)  Composition
2      3.060        g         Carbohydrate, by difference  Composition
3      3.280        g                                 Ash        Other
4    376.000     kcal                              Energy       Energy
5     39.280        g                               Water  Composition
6   1573.000       kJ                              Energy       Energy
7      0.000        g                Fiber, total dietary  Composition
8    673.000       mg                         Calcium, Ca     Elements
9      0.640       mg                            Iron, Fe     Elements
10    22.000       mg                       Magnesium, Mg     Elements
11   490.000       mg                       Phosphorus, P     Elements
12    93.000       mg                        Potassium, K     Elements
13   690.000       mg                          Sodium, Na     Elements
14     2.940       mg                            Zinc, Zn     Elements
15     0.024       mg                          Copper, Cu     Elements
16     0.021       mg                       Manganese, Mn     Elements
17    14.500      mcg                        Selenium, Se     Elements
18  1054.000       IU                       Vitamin A, IU     Vitamins
19   262.000      mcg                             Retinol     Vitamins
20   271.000  mcg_RAE                      Vitamin A, RAE     Vitamins
21     0.000       mg      Vitamin C, total ascorbic acid     Vitamins
22     0.031       mg                             Thiamin     Vitamins
23     0.450       mg                          Riboflavin     Vitamins
24     0.180       mg                              Niacin     Vitamins
25     0.190       mg                    Pantothenic acid     Vitamins
26     0.074       mg                         Vitamin B-6     Vitamins
27    18.000      mcg                       Folate, total     Vitamins
28     0.270      mcg                        Vitamin B-12     Vitamins
29     0.000      mcg                          Folic acid     Vitamins
30    18.000      mcg                        Folate, food     Vitamins
31    18.000  mcg_DFE                         Folate, DFE     Vitamins
32    93.000       mg                         Cholesterol        Other
33    18.584        g        Fatty acids, total saturated        Other
34     8.275        g  Fatty acids, total monounsaturated        Other
35     0.830        g  Fatty acids, total polyunsaturated        Other
36     0.324        g                          Tryptophan  Amino Acids
37     0.896        g                           Threonine  Amino Acids
38     1.563        g                          Isoleucine  Amino Acids
39     2.412        g                             Leucine  Amino Acids
40     0.028        g  Fatty acids, total monounsaturated        Other
41     0.041        g  Fatty acids, total polyunsaturated        Other

IndentationError: expected an indented block (<ipython-input-213-b9b57caf5eb3>, line 3)